lvx/base/DataProcessors/бит_ФормированиеПланируемыхПоступленийДСПоПервичнымДокументам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бит_ФормированиеПланируемыхПоступленийДСПоПервичнымДокументам</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомпоновщикНастроек</Name>
					<Type>
						<v8:Type>dcsset:SettingsComposer</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяОборотов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатьиОборотов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПервичныеДокументы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Comment>Организация</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Comment>Документ</Comment>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Comment>Номер документа</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>11</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Comment>Дата документа</Comment>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Comment>Контрагент</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦФО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяОборотов</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СтатьиОборотов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДокумента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Валюта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПоступления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сформирован</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДокумента</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Партнер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СостояниеДокумента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

lvx/base/Enums/бит_ТипыСохраненныхНастроек.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ТипыСохраненныхНастроек</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НастройкиПанелиИндикаторов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отчеты</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

lvx/base/DataProcessors/бит_ФормированиеПланируемыхПоступленийДСПоПервичнымДокументам/Forms/Форма/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПодготовитьФормуНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтраницыНастроекПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если (ТекущаяСтраница = Элементы.СтраницаНастройкиКомпоновщикаОтбор
	  ИЛИ ТекущаяСтраница = Элементы.СтраницаНастройкиКомпоновщикаПорядок) И ИзмененыВыбранныеТипы Тогда
		Если ТипыДокументовЗаполненыПравильно() Тогда
			ОбработатьИзменениеВыбранныхТипов();
		Иначе	
			ТекущаяСтраница = Элементы.СтраницаТипыДокументов;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодДатаНачалаПриИзменении(Элемент)
	
	ПриИзмененииПериода();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодДатаОкончанияПриИзменении(Элемент)
	
	ПриИзмененииПериода();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПервичныеДокументы

&НаКлиенте
Процедура ПервичныеДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле = Элементы.ПервичныеДокументыВидДокумента
	 ИЛИ Поле = Элементы.ПервичныеДокументыНомер 
	 ИЛИ Поле = Элементы.ПервичныеДокументыДата Тогда
	 	ТекущиеДанные = Элементы.ПервичныеДокументы.ТекущиеДанные;
	 		ПоказатьЗначение(, ТекущиеДанные.Документ);
	Иначе	
		бит_РаботаСДиалогамиКлиент.ОбработкаВыбораПоляТабличногоПоля("ПервичныеДокументы", 
			Объект.ПервичныеДокументы, Поле, ВыбраннаяСтрока);
	КонецЕсли;
		
КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТипыДокументов

&НаКлиенте
Процедура ТипыДокументовПриИзменении(Элемент)
	
	ИзмененыВыбранныеТипы = Истина;
	ИзмененыНастройки	  = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыКомпоновщикНастройкиОтбор

&НаКлиенте
Процедура КомпоновщикНастройкиОтборПриИзменении(Элемент)
	
	ИзмененыНастройки = Истина;
	
КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьПервичныеДокументы(Команда)
	
	Если НЕ ПериодЗаполненПравильно() ИЛИ НЕ СписокЗаполненПравильно()
		ИЛИ НЕ ТипыДокументовЗаполненыПравильно() Тогда
		Возврат;
	КонецЕсли;	
	
	СкрытьНастройки();
		
	ДобавленныеДокументы.Очистить();
	УстановитьОтборСформированныхДокументов(СформированныеДокументы, ДобавленныеДокументы);

	НачатьЗаполнениеСпискаДокументов();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьНастройки(Команда)
	
	ОткрытьНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьНастройки(Команда)
	
	СкрытьНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьПериод(Команда)

	Диалог = Новый ДиалогРедактированияСтандартногоПериода();
	Диалог.Период = Объект.Период;
	
	Оповещение = Новый ОписаниеОповещения("НастроитьПериодЗавершение",ЭтотОбъект);
	Диалог.Показать(Оповещение);
	
КонецПроцедуры

// Обработчик завершения редактирования периода.
//  См. Синтакс-помощник: Показать().
// 
&НаКлиенте 
Процедура НастроитьПериодЗавершение(РезультатВыбора, ДополнительныеПараметры) Экспорт
	
	Если РезультатВыбора <> Неопределено Тогда
		Объект.Период = РезультатВыбора;
		ПриИзмененииПериода();
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьНастройки(Команда)
	
	Если НЕ ПериодЗаполненПравильно() Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = ПараметрыХраненияНастроек();
	ПараметрыФормы.Вставить("СтруктураНастройки" , СохраняемыеНастройки());
	
	Оповещение = Новый ОписаниеОповещения("СохранитьНастройкиЗавершение",ЭтотОбъект);
	ОткрытьФорму("ХранилищеНастроек.бит_ХранилищеНастроек.ФормаСохранения", ПараметрыФормы, 
		ЭтотОбъект,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
											
КонецПроцедуры
	
// Обработчик завершения открытия формы.
//  См. Синтакс-помощник: ОткрытьФорму().
// 
&НаКлиенте
Процедура СохранитьНастройкиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда
		УстановитьЗаголовок(Результат, ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьНастройки(Команда)
	
	ПараметрыФормы = ПараметрыХраненияНастроек();
	Оповещение	   = Новый ОписаниеОповещения("ВыбратьНастройкиЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("ХранилищеНастроек.бит_ХранилищеНастроек.ФормаЗагрузки", ПараметрыФормы, 
		ЭтотОбъект,,,,Оповещение,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

// Обработчик завершения открытия формы.
//  См. Синтакс-помощник: ОткрытьФорму().
// 
&НаКлиенте 
Процедура ВыбратьНастройкиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Результат) Тогда        
		ПрименитьНастройки(Результат);
		
		ИзмененыНастройки = Истина;
		ОбработатьИзменениеНастроек(ЭтотОбъект);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура СтандартныеНастройки(Команда)
	
	ПрименитьНастройки(Неопределено);
	
	ИзмененыНастройки = Истина;
	ОбработатьИзменениеНастроек(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	ОбработатьФлагиПервичныеДокументы(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	ОбработатьФлагиПервичныеДокументы(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	
	Если НЕ СписокЗаполненПравильно() Тогда
		Возврат;	
	КонецЕсли;
	
	ОбъектыДляОбработки = Новый Массив;
	Для каждого СтрокаДокумента Из Объект.ПервичныеДокументы Цикл
		Если СтрокаДокумента.Пометка Тогда
			ОбъектыДляОбработки.Добавить(СтрокаДокумента.Документ);
		КонецЕсли;
	КонецЦикла;

	Если НЕ ЗначениеЗаполнено(ОбъектыДляОбработки) Тогда
		ТекстСообщения = НСтр("ru = 'Выберите документы для обработки.'; en = 'Select the documents to process.'");
		ПоказатьПредупреждение(, ТекстСообщения);
	Иначе
		НачатьСозданиеДокументов();
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ФоновоеЗаполнение

&НаКлиенте
Процедура НачатьЗаполнениеСпискаДокументов()

	Если НЕ ПериодЗаполненПравильно() Тогда
		Возврат;
	КонецЕсли;
	
	ИзмененыНастройки = Ложь;
	ОбработатьИзменениеНастроек(ЭтотОбъект);

	ДлительнаяОперация = ЗапуститьФоновоеЗаполнениеСпискаДокументов();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ТекстСообщения 	   = НСтр("ru = 'Идет заполнение списка документов'"); 
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗаполненияСпискаДокументов", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОписаниеОповещения, ПараметрыОжидания);

КонецПроцедуры

// Обработка оповещения. Подробности см.ДлительныеОперацииКлиент.ОжидатьЗавершение.
//
&НаКлиенте
Процедура ПослеЗаполненияСпискаДокументов(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.СтраницыСДокументами.ТекущаяСтраница = Элементы.СтраницаПервичныеДокументы;
	
	Если Результат.Статус <> "Выполнено" Тогда
		ТекстСообщения = НСтр("ru = 'Ошибка при выполнении: %1'"); 
		ПоказатьПредупреждение(, СтрШаблон(ТекстСообщения, Результат.КраткоеПредставлениеОшибки));
	Иначе
		ПослеЗаполненияСпискаДокументовНаСервере(Результат.АдресРезультата)	
	КонецЕсли; 

КонецПроцедуры

&НаСервере
Функция ЗапуститьФоновоеЗаполнениеСпискаДокументов()
		
	// Заполнение пераметов длительной операции.
	НаименованиеЗадания = НСтр("ru = 'Заполнение списка документов.'");
	ВыполняемыйМетод	= "Обработки.бит_ФормированиеПланируемыхПоступленийДСПоПервичнымДокументам.ЗаполнитьПереченьДокументов";

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
	
	НастройкиКомпоновки 	   = Объект.КомпоновщикНастроек.ПолучитьНастройки(); 
	АдресСхемыКомпоновкиДанных = ИнициализироватьКомпоновщик(Объект.КомпоновщикНастроек);
	СКД 					   = ПолучитьИзВременногоХранилища(АдресСхемыКомпоновкиДанных);
	
	НастройкиКомпоновкиДанных  = Объект.КомпоновщикНастроек.ПолучитьНастройки();
	
	бит_ОтчетыБФКлиентСервер.УстановитьПараметр(НастройкиКомпоновкиДанных, "Период", Объект.Период);
	
	ФоновоеЗадание = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, ВыполняемыйМетод, 
						СКД, НастройкиКомпоновкиДанных);
	Возврат ФоновоеЗадание;

КонецФункции

&НаСервере
Процедура ПослеЗаполненияСпискаДокументовНаСервере(АдресРезультата)

	РезультатПоиска    = Объект.ПервичныеДокументы.НайтиСтроки(Новый Структура("Пометка", Истина));
	ВыбранныеДокументы = Новый Массив;
	Для каждого Элемент Из РезультатПоиска Цикл
		ВыбранныеДокументы.Добавить(Элемент.Документ);
	КонецЦикла;
	
	ТаблицаДокументов  = ПолучитьИзВременногоХранилища(АдресРезультата);
	Объект.ПервичныеДокументы.Загрузить(ТаблицаДокументов);

	Если ЗначениеЗаполнено(ВыбранныеДокументы) Тогда
		Для каждого СтрокаТаблицы  Из Объект.ПервичныеДокументы Цикл
			СтрокаТаблицы.Пометка = ВыбранныеДокументы.Найти(СтрокаТаблицы.Документ) <> Неопределено;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры
	
#КонецОбласти // ФоновоеЗаполнение

#Область ФоновоеСозданиеДокументов

&НаКлиенте
Процедура НачатьСозданиеДокументов()

	ОчиститьСообщения();

	ДлительнаяОперация = ЗапуститьФоновоеСозданиеДокументов();
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ТекстСообщения 	   = НСтр("ru = 'Идет обработка списка документов'; en = 'The list of documents is being processed'"); 
	ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеСозданияДокументов", ЭтотОбъект);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОписаниеОповещения, ПараметрыОжидания);

КонецПроцедуры

&НаСервере
Функция ЗапуститьФоновоеСозданиеДокументов()
	
	ВыполняемыйМетод	= "Обработки.бит_ФормированиеПланируемыхПоступленийДСПоПервичнымДокументам.НовыеДокументыПланирования";
	НаименованиеЗадания = НСтр("ru = 'Формирование планируемых поступлений ДС.'; 
							|en = 'Generating Planned cash receipts'");

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НаименованиеЗадания;
	
	ВыбранныеДокументы = Объект.ПервичныеДокументы.Выгрузить(Новый Структура("Пометка", Истина));
	
	Для каждого СтрокаТаблицы  Из ВыбранныеДокументы Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ЦФО) И ЗначениеЗаполнено(Объект.ЦФО) Тогда
			СтрокаТаблицы.ЦФО = Объект.ЦФО;	
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.СтатьяОборотов) И ЗначениеЗаполнено(Объект.СтатьяОборотов) Тогда
			СтрокаТаблицы.СтатьяОборотов = Объект.СтатьяОборотов;	
		КонецЕсли;	
	КонецЦикла;

	ФоновоеЗадание = ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения, ВыполняемыйМетод, 
							ВыбранныеДокументы);
	Возврат ФоновоеЗадание;

КонецФункции

// Обработка оповещения. Подробности см.ДлительныеОперацииКлиент.ОжидатьЗавершение.
//
&НаКлиенте
Процедура ПослеСозданияДокументов(Результат, ДополнительныеПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		ПослеСозданияДокументовНаСервере(Результат.АдресРезультата);
	Иначе
		ТекстСообщения = НСтр("ru = 'Ошибка при выполнении: %1'"); 
		ПоказатьПредупреждение(, СтрШаблон(ТекстСообщения, Результат.КраткоеПредставлениеОшибки));
	КонецЕсли; 

КонецПроцедуры

&НаСервере
Процедура ПослеСозданияДокументовНаСервере(АдресРезультата)

	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	
	Если ТипЗнч(Результат) <> Тип("Соответствие") Тогда
		Возврат;
	КонецЕсли;

	Для каждого КлючЗначение Из Результат Цикл
		ДобавленныеДокументы.Добавить(КлючЗначение.Значение);
	КонецЦикла; 
	
	Для каждого СтрокаТаблицы Из Объект.ПервичныеДокументы Цикл
		Если СтрокаТаблицы.Пометка Тогда
			ДобавленныйДокумент = Результат.Получить(СтрокаТаблицы.Документ);	
			Если ЗначениеЗаполнено(ДобавленныйДокумент) Тогда
				СтрокаТаблицы.Пометка	  = Ложь;	
				СтрокаТаблицы.Сформирован = Истина;		
			КонецЕсли;		
		КонецЕсли;
	КонецЦикла;
	
	ЗначениеОтбора = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДобавленныеДокументы", ДобавленныеДокументы.ВыгрузитьЗначения());
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	бит_кзн_ПозицияПоступления.ДокументПланирования КАК ДокументПланирования
	|ИЗ
	|	Документ.бит_кзн_ПозицияПоступления КАК бит_кзн_ПозицияПоступления
	|ГДЕ
	|	бит_кзн_ПозицияПоступления.Ссылка В(&ДобавленныеДокументы)";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда
		ЗначениеОтбора.ЗагрузитьЗначения(РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("ДокументПланирования"));
	КонецЕсли;

	УстановитьОтборСформированныхДокументов(СформированныеДокументы, ЗначениеОтбора);
	
	Элементы.СтраницыСДокументами.ТекущаяСтраница = Элементы.СтраницаСформированныеДокументы;
	
КонецПроцедуры
	
#КонецОбласти // ФоновоеСозданиеДокументов

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();
		
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	// АПК:277-выкл Проектное решение вызвать функционал другой подсистемы.
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ПервичныеДокументыЦФО");
	// АПК:277-вкл
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Объект.ПервичныеДокументы.ЦФО", ВидСравненияКомпоновкиДанных.НеЗаполнено, "");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Объект.ЦФО", ВидСравненияКомпоновкиДанных.Заполнено, "");
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.бит_ТекстНедоступнойНадписи);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<Взять из настроек>'; en = '<Take from settings>'"));

	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	// АПК:277-выкл Проектное решение вызвать функционал другой подсистемы.
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ПервичныеДокументыСтатьяОборотов");
	// АПК:277-вкл
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Объект.ПервичныеДокументы.СтатьяОборотов", ВидСравненияКомпоновкиДанных.НеЗаполнено, "");
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
			"Объект.СтатьяОборотов", ВидСравненияКомпоновкиДанных.Заполнено, "");
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветТекста", ЦветаСтиля.бит_ТекстНедоступнойНадписи);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ОтметкаНезаполненного", Ложь);
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("Текст", НСтр("ru = '<Взять из настроек>'; en = '<Take from settings>'"));
	
	ЭлементУО = УсловноеОформление.Элементы.Добавить();
	// АПК:277-выкл Проектное решение вызвать функционал другой подсистемы.
	КомпоновкаДанныхКлиентСервер.ДобавитьОформляемоеПоле(ЭлементУО.Поля, "ПервичныеДокументыПометка");
	// АПК:277-вкл
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(ЭлементУО.Отбор,
		"Объект.ПервичныеДокументы.Сформирован", ВидСравненияКомпоновкиДанных.Равно, Истина);
	
	ЭлементУО.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеВыбранныхТипов()
	
	ИнициализироватьКомпоновщик(Объект.КомпоновщикНастроек);
	
	ИзмененыВыбранныеТипы = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииПериода()
	
	ИзмененыНастройки = Истина;
	ОбработатьИзменениеНастроек(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ОбработатьИзменениеНастроек(Форма)

	Форма.Элементы.ДекорацияИзмененыНастройки.Видимость = Форма.ИзмененыНастройки;
	Форма.Элементы.ПервичныеДокументы.Доступность    	= НЕ Форма.ИзмененыНастройки;
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьНастройки()

	Если ТипыДокументовЗаполненыПравильно() Тогда
		Элементы.РазделыОбработки.ТекущаяСтраница = Элементы.СтраницаОбработка;
		Элементы.ОбновитьПервичныеДокументы.КнопкаПоУмолчанию	  = Истина;
		
		Если ИзмененыНастройки Тогда
			ОбработатьИзменениеНастроек(ЭтотОбъект);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройки()

	Элементы.РазделыОбработки.ТекущаяСтраница	  = Элементы.СтраницаНастройкиОбработки;
	Элементы.ПрименитьНастройки.КнопкаПоУмолчанию = Истина;	

КонецПроцедуры

&НаСервере
Функция СохраняемыеНастройки()
	
	СохраняемыеНастройки = Обработки.бит_ФормированиеПланируемыхПоступленийДСПоПервичнымДокументам.НовыеСохраняемыеНастройки();

	ЗаполнитьЗначенияСвойств(СохраняемыеНастройки, Объект);
	
	НастройкаПериода = Объект.Период.Вариант;
	Если НастройкаПериода = ВариантСтандартногоПериода.ПроизвольныйПериод Тогда
		НастройкаПериода = ВариантСтандартногоПериода.Сегодня;
	КонецЕсли;
	
	СохраняемыеНастройки.ВариантПериода 		   = НастройкаПериода; 
	СохраняемыеНастройки.ВыбранныеТипы			   = Обработки.бит_ФормированиеПланируемыхПоступленийДСПоПервичнымДокументам.ВыбранныеТипы(ТипыДокументов);
	СохраняемыеНастройки.НастройкиКомпоновкиДанных = Объект.КомпоновщикНастроек.ПолучитьНастройки();
	
	Возврат СохраняемыеНастройки;
	
КонецФункции

&НаКлиенте
Функция ПериодЗаполненПравильно()

	ЗаполненПравильно = Истина;
	
	Отказ  = Ложь;
	
	Если НЕ ЗначениеЗаполнено(Объект.Период.ДатаНачала) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,, НСтр("ru = 'Начало периода';en = 'Period start'")); 
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "Период.ДатаНачала", "Объект", Отказ);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Период.ДатаОкончания) Тогда
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(,, НСтр("ru = 'Конец периода';en = 'Period end'")); 
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "Период.ДатаОкончания", "Объект", Отказ);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Период.ДатаНачала) И ЗначениеЗаполнено(Объект.Период.ДатаОкончания) Тогда
		Если Объект.Период.ДатаОкончания < Объект.Период.ДатаНачала Тогда
			ТекстСообщения = НСтр("ru='Период указан неверно. Дата начала больше даты окончания.';
								  |en='The period is incorrect. The start date is greater than the end date.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, "Период.ДатаНачала", "Объект", Отказ);
		КонецЕсли;
	КонецЕсли; 
	
	Если Отказ Тогда
		ЗаполненПравильно = Ложь;
	КонецЕсли;  
	
	Возврат ЗаполненПравильно; 

КонецФункции

&НаКлиенте
Функция ТипыДокументовЗаполненыПравильно()

	ПометкаУстановлена = Ложь;
	
	Для каждого Элемент Из ТипыДокументов Цикл
		Если Элемент.Пометка Тогда
			ПометкаУстановлена = Истина;	
			Прервать;
		КонецЕсли;	
	КонецЦикла;
	
	Если НЕ ПометкаУстановлена Тогда
		ОткрытьНастройки();
		
		ТекстПояснения = НСтр("ru = 'Выберите типы документов.'; en = 'Select the document types.'");
		ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения("Список" , "КОРРЕКТНОСТЬ",,,
							НСтр("ru = 'Типы документов'; en = 'Types of documents'"), ТекстПояснения);
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения, , "ТипыДокументов");
	КонецЕсли;
	
	Возврат ПометкаУстановлена;
	
КонецФункции

&НаКлиенте
Функция СписокЗаполненПравильно()

	Отказ = Ложь;
	Для каждого СтрокаТаблицы Из Объект.ПервичныеДокументы Цикл
		Префикс = "ПервичныеДокументы[%1].";
		Префикс = СтрШаблон(Префикс, Формат(СтрокаТаблицы.НомерСтроки - 1, "ЧН=0; ЧГ="));

		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.ЦФО) И НЕ ЗначениеЗаполнено(Объект.ЦФО) И СтрокаТаблицы.Пометка Тогда
			Поле = Префикс + "ЦФО";
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
				"КОЛОНКА",, НСтр("ru = 'ЦФО'; en = 'Fin. Resp. Ctr.'"), СтрокаТаблицы.НомерСтроки,
				НСтр("ru = 'Перечень документов'; en = 'Document List'"));
			
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, Поле, "Объект", Отказ);
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СтрокаТаблицы.СтатьяОборотов) И НЕ ЗначениеЗаполнено(Объект.СтатьяОборотов) И СтрокаТаблицы.Пометка Тогда
			Поле = Префикс + "СтатьяОборотов";
			ТекстСообщения = ОбщегоНазначенияКлиентСервер.ТекстОшибкиЗаполнения(
				"КОЛОНКА",, НСтр("ru = 'Статья оборотов'; en = 'Line Item'"), СтрокаТаблицы.НомерСтроки,
				НСтр("ru = 'Перечень документов'; en = 'Document List'"));
			
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,, Поле, "Объект", Отказ);
		КонецЕсли;
	КонецЦикла;

	Возврат НЕ Отказ;
	
КонецФункции

&НаКлиенте
Функция ПараметрыХраненияНастроек()

	ПараметрыХранения = Новый Структура;
	ПараметрыХранения.Вставить("ТипНастройки",		  ПредопределенноеЗначение("Перечисление.бит_ТипыСохраненныхНастроек.Обработки"));
	ПараметрыХранения.Вставить("НастраиваемыйОбъект", НастраиваемыйОбъект());

	Возврат ПараметрыХранения;
	
КонецФункции

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	НастройкаПоУмолчанию = бит_ОтчетыСервер.НайтиНастройкуПоУмолчаниюДляОбъекта(НастраиваемыйОбъект());
	Обработки.бит_ФормированиеПланируемыхПоступленийДСПоПервичнымДокументам.ЗаполнитьТипыДокументов(ТипыДокументов);
	
	ИспользоватьПартнеровИКонтрагентов = ПолучитьФункциональнуюОпцию("ИспользоватьПартнеровИКонтрагентов");
	Элементы.ПервичныеДокументыКонтрагент.Видимость = ИспользоватьПартнеровИКонтрагентов;
	
	ПрименитьНастройки(НастройкаПоУмолчанию);
	
	ИзмененыНастройки = Ложь;
	
	УстановитьОтборСформированныхДокументов(СформированныеДокументы, ДобавленныеДокументы);
	УстановитьУсловноеОформление();
	ОбработатьИзменениеНастроек(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция НастраиваемыйОбъект()

	Возврат "Обработка.бит_ФормированиеПланируемыхПоступленийДСПоПервичнымДокументам";

КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьОтборСформированныхДокументов(Список, ЗначениеОтбора)

	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список,
			"Ссылка",ЗначениеОтбора, ВидСравненияКомпоновкиДанных.ВСписке,,,
			РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
			
КонецПроцедуры 

&НаСервере
Процедура ПрименитьНастройки(НастройкаПодбораДокументов)
	
	АдресСхемыКомпоновкиДанных = Обработки.бит_ФормированиеПланируемыхПоступленийДСПоПервичнымДокументам.ПрименитьНастройки(
									НастройкаПодбораДокументов, ТипыДокументов, Объект);
									
	УстановитьЗаголовок(НастройкаПодбораДокументов, ЭтотОбъект);
		
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьЗаголовок(Настройка, Форма)

	Заголовок = НСтр("ru = 'Формирование поступлений по первичным документам %1';
					|en = 'Formation of receipts according to primary documents %1'");
	
	Если ЗначениеЗаполнено(Настройка) Тогда
		Заголовок = СтрШаблон(Заголовок, "(" + Строка(Настройка) + ")");
	Иначе	
		Заголовок = СтрШаблон(Заголовок, "");
	КонецЕсли;

	Форма.Заголовок = Заголовок;

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьФлагиПервичныеДокументы(ЗначениеФлага)
	
	Для каждого ТекущаяСтрока Из Объект.ПервичныеДокументы Цикл
		ИдентификаторСтроки = ТекущаяСтрока.ПолучитьИдентификатор();
		СтрокаСуществует 	= Элементы.ПервичныеДокументы.ПроверитьСтроку(ИдентификаторСтроки); 
		Если СтрокаСуществует = Истина И НЕ ТекущаяСтрока.Сформирован Тогда
			ТекущаяСтрока.Пометка = ЗначениеФлага;
		КонецЕсли;
	КонецЦикла; 

КонецПроцедуры

&НаСервере
Функция ИнициализироватьКомпоновщик(КомпоновщикНастроек)

	НастройкиКомпоновкиДанных = КомпоновщикНастроек.ПолучитьНастройки();
	
	ВыбранныеТипы = Обработки.бит_ФормированиеПланируемыхПоступленийДСПоПервичнымДокументам.ВыбранныеТипы(ТипыДокументов);
	
	АдресСКД = Обработки.бит_ФормированиеПланируемыхПоступленийДСПоПервичнымДокументам.ИнициализироватьКомпоновщик(КомпоновщикНастроек, 
						ВыбранныеТипы, НастройкиКомпоновкиДанных);
						
	КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиКомпоновкиДанных);					
	
	Возврат АдресСКД;
	     
КонецФункции

#КонецОбласти
